stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_lora.c
/**
  ******************************************************************************
  * @file  stm32wlxx_radio_lora.c
  * @brief LoRa-specific portion of the radio driver for the STM32WLxx Radio App
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include "stm32wlxx_radio.h"
#include "stm32wlxx_radio_hal.h"
#include "stm32wlxx_phy.h"
#include "stm32wlxx_phy_timings.h"

#include <sid_lora_phy_cfg.h>
#include <sid_pal_assert_ifc.h>
#include <sid_pal_log_ifc.h>

#include <sid_stm32_common_utils.h>

/* Private defines -----------------------------------------------------------*/

#define STM32WLxx_LORA_RX_PROCESS_SAFETY_GAP_US  (50u) /*!< Rx window will be opened earlier by this amount of microseconds to mitigate any SW execution delays and jitter */

/* Private macros ------------------------------------------------------------*/

#ifndef STM32WLxx_RADIO_LORA_EXTRA_LOGGING
/* Set STM32WLxx_RADIO_LORA_EXTRA_LOGGING to 1 to enable extended logs */
#  define STM32WLxx_RADIO_LORA_EXTRA_LOGGING (0)
#endif

#if STM32WLxx_RADIO_LORA_EXTRA_LOGGING
#  define STM32WLxx_LORA_LOG_ERROR(...)   SID_PAL_LOG_ERROR(__VA_ARGS__)
#  define STM32WLxx_LORA_LOG_WARNING(...) SID_PAL_LOG_WARNING(__VA_ARGS__)
#  define STM32WLxx_LORA_LOG_INFO(...)    SID_PAL_LOG_INFO(__VA_ARGS__)
#  define STM32WLxx_LORA_LOG_DEBUG(...)   SID_PAL_LOG_DEBUG(__VA_ARGS__)
#  define STM32WLxx_LORA_LOG_TRACE(...)   SID_PAL_LOG_TRACE(__VA_ARGS__)
#else
#  define STM32WLxx_LORA_LOG_ERROR(...)   ((void)0u)
#  define STM32WLxx_LORA_LOG_WARNING(...) ((void)0u)
#  define STM32WLxx_LORA_LOG_INFO(...)    ((void)0u)
#  define STM32WLxx_LORA_LOG_DEBUG(...)   ((void)0u)
#  define STM32WLxx_LORA_LOG_TRACE(...)   ((void)0u)
#endif

/* Private constants ---------------------------------------------------------*/

#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
static const uint32_t radio_lora_symb_time[3][8] = {
                                                        { 32768u, 16384u, 8192u, 4096u, 2048u, 1024u, 512u, 256u }, /* 125 KHz */
                                                        { 16384u,  8192u, 4096u, 2048u, 1024u,  512u, 256u, 128u }, /* 250 KHz */
                                                        {  8192u,  4096u, 2048u, 1024u,  512u,  256u, 128u,  64u }, /* 500 KHz */
                                                    };
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */

/* Private function prototypes -----------------------------------------------*/

static inline uint32_t _lora_need_low_data_rate_optimize(const stm32wlxx_lora_sf_t sf, const stm32wlxx_lora_bw_t bw);
static inline void     _sid_radio_convert_to_stm32wlxx_lora_mod_params(stm32wlxx_mod_params_lora_t * const sx_m, const sid_pal_radio_lora_modulation_params_t * const rd_m);
static inline void     _sid_radio_convert_to_stm32wlxx_lora_pkt_params(stm32wlxx_pkt_params_lora_t * const sx_p, const sid_pal_radio_lora_packet_params_t * const rd_p);

/* Private function definitions ----------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline uint32_t _lora_need_low_data_rate_optimize(const stm32wlxx_lora_sf_t sf, const stm32wlxx_lora_bw_t bw)
{
    uint32_t enable_ldr_optimizations;

    if (((bw == STM32WLxx_LORA_BW_125) && ((sf == STM32WLxx_LORA_SF11) || (sf == STM32WLxx_LORA_SF12)))
     || ((bw == STM32WLxx_LORA_BW_250) &&  (sf == STM32WLxx_LORA_SF12)))
    {
        enable_ldr_optimizations = TRUE;
    }
    else
    {
        enable_ldr_optimizations = FALSE;
    }

    return enable_ldr_optimizations;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void _sid_radio_convert_to_stm32wlxx_lora_mod_params(stm32wlxx_mod_params_lora_t * const sx_m, const sid_pal_radio_lora_modulation_params_t * const rd_m)
{
    sx_m->sf   = (stm32wlxx_lora_sf_t)rd_m->spreading_factor;
    sx_m->bw   = (stm32wlxx_lora_bw_t)rd_m->bandwidth;
    sx_m->ldro = _lora_need_low_data_rate_optimize(rd_m->spreading_factor, rd_m->bandwidth) == FALSE ? 0u : 1u;

    /* unfortunately long interleaved mode is not supported by WL55, so changing it to modes without LI */
    switch (rd_m->coding_rate)
    {
        case STM32WLxx_LORA_CR_4_5:
        case STM32WLxx_LORA_CR_4_5_LI:
            sx_m->cr = STM32WLxx_LORA_CR_4_5;
            break;

        case STM32WLxx_LORA_CR_4_6:
        case STM32WLxx_LORA_CR_4_6_LI:
            sx_m->cr = STM32WLxx_LORA_CR_4_6;
            break;

        case STM32WLxx_LORA_CR_4_7:
            sx_m->cr = STM32WLxx_LORA_CR_4_7;
            break;

        case STM32WLxx_LORA_CR_4_8:
        case STM32WLxx_LORA_CR_4_8_LI:
            sx_m->cr = STM32WLxx_LORA_CR_4_8;
            break;

        default:
            SID_PAL_LOG_ERROR("_sid_radio_convert_to_stm32wlxx_lora_mod_params: coding rate selector is not supported, requested CR is 0x%x", (uint32_t)rd_m->coding_rate);
            break;
    }
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void _sid_radio_convert_to_stm32wlxx_lora_pkt_params(stm32wlxx_pkt_params_lora_t * const sx_p, const sid_pal_radio_lora_packet_params_t * const rd_p)
{
    sx_p->pbl_len_in_symb = rd_p->preamble_length;
    sx_p->hdr_type =  (stm32wlxx_lora_pkt_len_modes_t)rd_p->header_type;
    sx_p->pld_len_in_bytes = rd_p->payload_length;
    sx_p->crc_is_on = rd_p->crc_mode;
    sx_p->invert_iq_is_on = rd_p->invert_IQ;
}

/*----------------------------------------------------------------------------*/

