stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_lora.c
SID_STM32_SPEED_OPTIMIZED sid_pal_radio_data_rate_t sid_pal_radio_lora_mod_params_to_data_rate(const sid_pal_radio_lora_modulation_params_t * mod_params)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    sid_pal_radio_data_rate_t dr = SID_PAL_RADIO_DATA_RATE_INVALID;

    if (SID_PAL_RADIO_LORA_BW_500KHZ == mod_params->bandwidth)
    {
        if ((SID_PAL_RADIO_LORA_CODING_RATE_4_5 == mod_params->coding_rate) || (SID_PAL_RADIO_LORA_CODING_RATE_4_5_LI == mod_params->coding_rate))
        {
            if (SID_PAL_RADIO_LORA_SF11 == mod_params->spreading_factor)
            {
                dr = SID_PAL_RADIO_DATA_RATE_2KBPS;
            }
            else if (SID_PAL_RADIO_LORA_SF8 == mod_params->spreading_factor)
            {
                dr = SID_PAL_RADIO_DATA_RATE_12_5KBPS;
            }
            else
            {
                /* Invalid */
            }
        }
        else if (SID_PAL_RADIO_LORA_CODING_RATE_4_6 == mod_params->coding_rate)
        {
            if (SID_PAL_RADIO_LORA_SF7 == mod_params->spreading_factor)
            {
                dr = SID_PAL_RADIO_DATA_RATE_22KBPS;
            }
        }
        else
        {
            /* Invalid */
        }
    }

    return dr;
#else
    (void)mod_params;

    return SID_PAL_RADIO_DATA_RATE_INVALID;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_lora_data_rate_to_mod_params(sid_pal_radio_lora_modulation_params_t * mod_params, sid_pal_radio_data_rate_t data_rate, uint8_t li_enable)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    int err = RADIO_ERROR_NONE;

    /* STM32WLxx radio does not support Long Interleaver, so fall back to non-interleaved CR */
    switch (data_rate)
    {
        case SID_PAL_RADIO_DATA_RATE_22KBPS:
            mod_params->spreading_factor = SID_PAL_RADIO_LORA_SF7;
            mod_params->bandwidth        = SID_PAL_RADIO_LORA_BW_500KHZ;
            mod_params->coding_rate      = SID_PAL_RADIO_LORA_CODING_RATE_4_6;
            break;

        case SID_PAL_RADIO_DATA_RATE_12_5KBPS:
            mod_params->spreading_factor = SID_PAL_RADIO_LORA_SF8;
            mod_params->bandwidth        = SID_PAL_RADIO_LORA_BW_500KHZ;
            mod_params->coding_rate      = SID_PAL_RADIO_LORA_CODING_RATE_4_5; /* CR 4/5-LI is not supported */
            break;

        case SID_PAL_RADIO_DATA_RATE_2KBPS:
            mod_params->spreading_factor = SID_PAL_RADIO_LORA_SF11;
            mod_params->bandwidth        = SID_PAL_RADIO_LORA_BW_500KHZ;
            mod_params->coding_rate      = SID_PAL_RADIO_LORA_CODING_RATE_4_5; /* CR 4/5-LI is not supported */
            break;

        default:
            err = RADIO_ERROR_NOT_SUPPORTED;
            break;
    }

    return err;
#else
    (void)mod_params;
    (void)data_rate;
    (void)li_enable;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_lora_sync_word(uint16_t sync_word)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    int32_t                          err     = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t           hal_err;
    halo_drv_stm32wlxx_ctx_t * const drv_ctx = (halo_drv_stm32wlxx_ctx_t *)stm32wlxx_radio_get_drv_ctx_ctx();

    do
    {
        /* Check if we have any changes */
        if (drv_ctx->applied_lora_phy_cfg.sync_word == sync_word)
        {
            STM32WLxx_LORA_LOG_DEBUG("Set LoRa sync word - skipped, no changes");
            err = RADIO_ERROR_NONE;
            break;
        }

        hal_err = stm32wlxx_hal_radio_set_syncword(drv_ctx, STM32WLxx_SUBGHZ_RADIO_MODEM_MODE_LORA, (void *)&sync_word, sizeof(sync_word));
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Everything is fine, store the update */
        drv_ctx->applied_lora_phy_cfg.sync_word = sync_word;
        err = RADIO_ERROR_NONE;
    } while (0);

    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply LoRa sync word. Error %d", (int32_t)err);
    }

    return err;
#else
    (void)sync_word;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_lora_symbol_timeout(uint8_t num_of_symbols)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    int32_t                          err     = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t           hal_err;
    halo_drv_stm32wlxx_ctx_t * const drv_ctx = (halo_drv_stm32wlxx_ctx_t *)stm32wlxx_radio_get_drv_ctx_ctx();

    do
    {
        /* Check if we have any changes */
        if (drv_ctx->applied_lora_phy_cfg.symbol_timeout == num_of_symbols)
        {
            STM32WLxx_LORA_LOG_DEBUG("Set LoRa symbol timeout - skipped, no changes");
            err = RADIO_ERROR_NONE;
            break;
        }

        /* Update is needed */
        hal_err = stm32wlxx_hal_set_lora_symbol_timeout(stm32wlxx_radio_get_drv_ctx_ctx(), num_of_symbols);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            SID_PAL_LOG_ERROR("Failed to set LoRa symbol timeout. HAL error %u", (uint32_t)hal_err);
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Everything is fine, store the update */
        drv_ctx->applied_lora_phy_cfg.symbol_timeout = num_of_symbols;
        err = RADIO_ERROR_NONE;
    } while (0);

    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply LoRa symbol timeout. Error %d", (int32_t)err);
    }

    return err;
#else
    (void)num_of_symbols;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

