stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_lora.c
SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_lora_modulation_params(const sid_pal_radio_lora_modulation_params_t * mod_params)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    int32_t                                        err               = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t                         hal_err;
    const halo_drv_stm32wlxx_ctx_t * const         drv_ctx           = stm32wlxx_radio_get_drv_ctx_ctx();
    sid_pal_radio_lora_modulation_params_t * const active_mod_params = (sid_pal_radio_lora_modulation_params_t *)&drv_ctx->applied_lora_phy_cfg.lora_modulation_params;

    do
    {
        /* Note: always send out modulation parameters even if there are no changes to keep Rx/Tx setup timings consistent */
        stm32wlxx_radio_lora_phy_mod_params_t hal_mod_params = {
            .bandwidth        = mod_params->bandwidth,
            .coding_rate      = mod_params->coding_rate,
            .spreading_factor = mod_params->spreading_factor,
        };

        hal_err = stm32wlxx_hal_set_lora_modulation_params(drv_ctx, &hal_mod_params);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Everything is fine, store the update */
        SID_STM32_UTIL_fast_memcpy((void *)active_mod_params, mod_params, sizeof(*active_mod_params));
        err = RADIO_ERROR_NONE;
    } while (0);

    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply LoRa modulation params. Error %d", (int32_t)err);
    }

    return err;
#else
    (void)mod_params;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_lora_packet_params(const sid_pal_radio_lora_packet_params_t * packet_params)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    int32_t                                    err               = RADIO_ERROR_GENERIC;
    stm32wlxx_hal_status_t                     hal_err;
    const halo_drv_stm32wlxx_ctx_t * const     drv_ctx           = stm32wlxx_radio_get_drv_ctx_ctx();
    sid_pal_radio_lora_packet_params_t * const active_pkt_params = (sid_pal_radio_lora_packet_params_t *)&drv_ctx->applied_lora_phy_cfg.lora_packet_params;

    do
    {
        /* Note: always send out packet parameters even if there are no changes to keep Rx/Tx setup timings consistent */
        stm32wlxx_radio_lora_phy_pkt_params_t hal_pkt_params = {
            .crc_mode        = packet_params->crc_mode,
            .header_type     = packet_params->header_type,
            .invert_IQ       = packet_params->invert_IQ,
            .payload_length  = packet_params->payload_length,
            .preamble_length = packet_params->preamble_length,
        };

        hal_err = stm32wlxx_hal_radio_set_lora_pkt_params(drv_ctx, hal_pkt_params);
        if (hal_err != STM32WLxx_HAL_STATUS_OK)
        {
            err = RADIO_ERROR_HARDWARE_ERROR;
            break;
        }

        /* Everything is fine, store the update */
        SID_STM32_UTIL_fast_memcpy((void *)active_pkt_params, packet_params, sizeof(*active_pkt_params));
        err = RADIO_ERROR_NONE;
    } while (0);

    if (err != RADIO_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to apply LoRa packet params. Error %d", (int32_t)err);
    }

    return err;
#else
    (void)packet_params;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED int32_t sid_pal_radio_set_lora_cad_params(const sid_pal_radio_lora_cad_params_t *cad_params)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    stm32wlxx_hal_status_t hal_err;
    halo_drv_stm32wlxx_ctx_t * const drv_ctx = (halo_drv_stm32wlxx_ctx_t *)stm32wlxx_radio_get_drv_ctx_ctx();

    drv_ctx->cad_exit_mode = cad_params->cad_exit_mode;

    // FIXME: 1. send actual CAD params, 2. skip sending if there's no change
    hal_err = stm32wlxx_hal_radio_set_lora_cad_params(drv_ctx);
    if (hal_err != STM32WLxx_HAL_STATUS_OK)
    {
        return RADIO_ERROR_HARDWARE_ERROR;
    }

    return RADIO_ERROR_NONE;
#else
    (void)cad_params;

    return RADIO_ERROR_NOT_SUPPORTED;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t sid_pal_radio_lora_cad_duration(uint8_t symbol, const sid_pal_radio_lora_modulation_params_t * mod_params)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    uint32_t cad_duration;

    if (mod_params != NULL)
    {
        SID_PAL_ASSERT(SID_PAL_RADIO_LORA_BW_125KHZ == 0x04u);
        SID_PAL_ASSERT(mod_params->bandwidth >= SID_PAL_RADIO_LORA_BW_125KHZ);

        SID_PAL_ASSERT(SID_PAL_RADIO_LORA_SF12 == 0x0Cu);
        SID_PAL_ASSERT(mod_params->spreading_factor <= SID_PAL_RADIO_LORA_SF12);

        const uint32_t bw_idx = mod_params->bandwidth - SID_PAL_RADIO_LORA_BW_125KHZ;
        const uint32_t sf_idx = SID_PAL_RADIO_LORA_SF12 - mod_params->spreading_factor;

        SID_PAL_ASSERT(bw_idx < SID_STM32_UTIL_ARRAY_SIZE(radio_lora_symb_time));
        SID_PAL_ASSERT(sf_idx < SID_STM32_UTIL_ARRAY_SIZE(radio_lora_symb_time[0]));

        /* Compute single symbol duration in us for the given modulation params */
        const uint32_t symbol_time_us = radio_lora_symb_time[bw_idx][sf_idx];

        /* Compute CAD timeout based on the CAD duration in symbols */
        cad_duration = symbol_time_us * symbol;
    }
    else
    {
        cad_duration = 0u;
    }

    return cad_duration;
#else
    (void)symbol;
    (void)mod_params;

    return 0u;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t sid_pal_radio_lora_time_on_air(const sid_pal_radio_lora_modulation_params_t * mod_params, const sid_pal_radio_lora_packet_params_t * packet_params, uint8_t packet_len)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    uint32_t time_on_air;

    if ((NULL == mod_params) || (NULL == packet_params))
    {
        time_on_air = 0u;
    }
    else
    {
        stm32wlxx_pkt_params_lora_t lora_packet_params;
        stm32wlxx_mod_params_lora_t lora_mod_params;

