stm32-hotspot/STM32-Sidewalk-SDK/platform/sid_mcu/st/hal/stm32wlxx_radio_app/stm32wlxx_radio_lora.c
        _sid_radio_convert_to_stm32wlxx_lora_mod_params(&lora_mod_params, mod_params);
        _sid_radio_convert_to_stm32wlxx_lora_pkt_params(&lora_packet_params, packet_params);
        lora_packet_params.pld_len_in_bytes = packet_len;

        time_on_air = stm32wlxx_phy_get_lora_time_on_air_in_ms(&lora_packet_params, &lora_mod_params);
    }

    return time_on_air;
#else
    (void)mod_params;
    (void)packet_params;
    (void)packet_len;

    return 0u;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t sid_pal_radio_lora_get_lora_number_of_symbols(const sid_pal_radio_lora_modulation_params_t * mod_params, uint32_t delay_micro_sec)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    uint32_t numsymbols;
    if (mod_params != NULL)
    {
        SID_PAL_ASSERT(SID_PAL_RADIO_LORA_BW_125KHZ == 0x04u);
        SID_PAL_ASSERT(mod_params->bandwidth >= SID_PAL_RADIO_LORA_BW_125KHZ);

        SID_PAL_ASSERT(SID_PAL_RADIO_LORA_SF12 == 0x0Cu);
        SID_PAL_ASSERT(mod_params->spreading_factor <= SID_PAL_RADIO_LORA_SF12);

        const uint32_t bw_idx = mod_params->bandwidth - SID_PAL_RADIO_LORA_BW_125KHZ;
        const uint32_t sf_idx = SID_PAL_RADIO_LORA_SF12 - mod_params->spreading_factor;

        SID_PAL_ASSERT(bw_idx < SID_STM32_UTIL_ARRAY_SIZE(radio_lora_symb_time));
        SID_PAL_ASSERT(sf_idx < SID_STM32_UTIL_ARRAY_SIZE(radio_lora_symb_time[0]));

        const uint32_t ts = radio_lora_symb_time[bw_idx][sf_idx];
        numsymbols = (delay_micro_sec + (ts - 1u)) / ts; /* Round up */
    }
    else
    {
        numsymbols = 0u;
    }

    return numsymbols;
#else
    (void)mod_params;
    (void)delay_micro_sec;

    return 0u;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t sid_pal_radio_get_lora_rx_done_delay(const sid_pal_radio_lora_modulation_params_t * mod_params, const sid_pal_radio_lora_packet_params_t * pkt_params)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    stm32wlxx_pkt_params_lora_t lora_packet_params;
    stm32wlxx_mod_params_lora_t lora_mod_params;

    _sid_radio_convert_to_stm32wlxx_lora_mod_params(&lora_mod_params, mod_params);
    _sid_radio_convert_to_stm32wlxx_lora_pkt_params(&lora_packet_params, pkt_params);

    return stm32wlxx_phy_timings_get_delay_between_last_bit_sent_and_rx_done_in_us(&lora_mod_params, &lora_packet_params);
#else
    (void)mod_params;
    (void)pkt_params;

    return 0u;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t sid_pal_radio_get_lora_tx_process_delay(void)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    const halo_drv_stm32wlxx_ctx_t * const drv_ctx = stm32wlxx_radio_get_drv_ctx_ctx();
    SID_PAL_ASSERT(drv_ctx != NULL);
    SID_PAL_ASSERT(drv_ctx->config != NULL);

    const uint32_t lora_tx_process_delay =
        (STM32WLxx_RADIO_CFG_USE_DEFAULT_TIMINGS == drv_ctx->config->processing_timings.lora.tx_process_delay_us) ?
        STM32WLxx_LORA_TX_DEFAULT_PROCESS_DELAY_US : drv_ctx->config->processing_timings.lora.tx_process_delay_us;

    const uint32_t process_delay = lora_tx_process_delay + drv_ctx->config->state_timings.tcxo_delay_us;
    return process_delay;
#else
    return 0u;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t sid_pal_radio_get_lora_rx_process_delay(void)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    const halo_drv_stm32wlxx_ctx_t * const drv_ctx = stm32wlxx_radio_get_drv_ctx_ctx();
    SID_PAL_ASSERT(drv_ctx != NULL);
    SID_PAL_ASSERT(drv_ctx->config != NULL);

    const uint32_t lora_rx_process_delay =
        (STM32WLxx_RADIO_CFG_USE_DEFAULT_TIMINGS == drv_ctx->config->processing_timings.lora.rx_process_delay_us) ?
        STM32WLxx_LORA_RX_DEFAULT_PROCESS_DELAY_US : drv_ctx->config->processing_timings.lora.rx_process_delay_us;

    const uint32_t process_delay = lora_rx_process_delay + drv_ctx->config->state_timings.tcxo_delay_us + STM32WLxx_LORA_RX_PROCESS_SAFETY_GAP_US;
    return process_delay;
#else
    return 0u;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t sid_pal_radio_get_lora_symbol_timeout_us(sid_pal_radio_lora_modulation_params_t * mod_params, uint8_t number_of_symbol)
{
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    uint32_t symbol_timeout;

    if (mod_params != NULL)
    {
        SID_PAL_ASSERT(SID_PAL_RADIO_LORA_BW_125KHZ == 0x04u);
        SID_PAL_ASSERT(mod_params->bandwidth >= SID_PAL_RADIO_LORA_BW_125KHZ);

        SID_PAL_ASSERT(SID_PAL_RADIO_LORA_SF12 == 0x0Cu);
        SID_PAL_ASSERT(mod_params->spreading_factor <= SID_PAL_RADIO_LORA_SF12);

        const uint32_t bw_idx = mod_params->bandwidth - SID_PAL_RADIO_LORA_BW_125KHZ;
        const uint32_t sf_idx = SID_PAL_RADIO_LORA_SF12 - mod_params->spreading_factor;

        SID_PAL_ASSERT(bw_idx < SID_STM32_UTIL_ARRAY_SIZE(radio_lora_symb_time));
        SID_PAL_ASSERT(sf_idx < SID_STM32_UTIL_ARRAY_SIZE(radio_lora_symb_time[0]));

        symbol_timeout = radio_lora_symb_time[bw_idx][sf_idx] * number_of_symbol;
    }
    else
    {
        symbol_timeout = 0u;
    }

    return symbol_timeout;
#else
    (void)mod_params;
    (void)number_of_symbol;

    return 0u;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
}
